xuehuiniaoyu/CombuilderDocs/examples/sdkconfig.defaults
CONFIG_IDF_TARGET_ESP32S3=y
CONFIG_IDF_TARGET="esp32s3"

# Xingzhi Cube / ESP32-S3 default

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000
# Large font loading may exceed default 5s WDT; ui_font temporarily disables IDLE monitoring
CONFIG_ESP_TASK_WDT_TIMEOUT_S=15

# LVGL: Large fonts (several MB) loaded entirely into RAM; must use libc malloc (via PSRAM)
# Built-in 128KB pool will OOM during lv_binfont parsing → null pointer write → reboot loop
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_MEM_SIZE_KILOBYTES=128
CONFIG_LV_USE_FONT_COMPRESSED=y
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_USE_FS_STDIO=y
CONFIG_LV_FS_STDIO_LETTER=70
CONFIG_LV_FS_STDIO_PATH="/flash/"
CONFIG_LV_USE_FS_MEMFS=y
CONFIG_LV_FS_MEMFS_LETTER=77
CONFIG_LV_USE_FS_POSIX=y
CONFIG_LV_FS_POSIX_LETTER=83
CONFIG_LV_FS_POSIX_PATH="/flash/"

# Hardware debugging: UART screenshot capture
CONFIG_LV_USE_SNAPSHOT=y

# Xingzhi Cube uses onboard USB Serial/JTAG (/dev/cu.usbmodem*); main console via USJ,
# hardware debugging receives @@ESP32UI_SNAP on same port (UART console: USB only logs, no commands)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Default board: Xingzhi

CONFIG_ESP32_UI_BOARD_XINGZHI_CUBE_1_54TFT_ML307=y
# CONFIG_ESP32_UI_BOARD_NONE is not set